In [2]:
import pandas as pd
import numpy as np

In [3]:
s = pd.Series([1, 3, 5, 3, 6, 8])
s

0    1
1    3
2    5
3    3
4    6
5    8
dtype: int64

In [4]:
s1 = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s1

a    0.394899
b    0.489090
c   -0.034043
d   -1.102259
e    0.686116
dtype: float64

In [5]:
s1['a']

0.3948993161314782

In [6]:
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [7]:
data = pd.Series(range(100,1000,100))
data

0    100
1    200
2    300
3    400
4    500
5    600
6    700
7    800
8    900
dtype: int64

In [8]:
slice1 = data[2:7]
slice1

2    300
3    400
4    500
5    600
6    700
dtype: int64

In [9]:
slice1[3:5]

5    600
6    700
dtype: int64

In [10]:
slice1

2    300
3    400
4    500
5    600
6    700
dtype: int64

In [11]:
slice1.iloc[3:5] # берется как в срезах от 3 по 4 (от 0 до числа не включит)

5    600
6    700
dtype: int64

In [12]:
slice1.loc[3:5] # берется по индексу 3,4,5

3    400
4    500
5    600
dtype: int64

Add Data to Series

In [13]:
s = pd.Series(data = [0, 10, 30, 20], index = [1,2,3,4])

In [14]:
s

1     0
2    10
3    30
4    20
dtype: int64

In [15]:
s.pop(1)  # удаляется по индексу вся строка

0

In [16]:
s

2    10
3    30
4    20
dtype: int64

In [17]:
s.loc[5] = 40  # 
s

2    10
3    30
4    20
5    40
dtype: int64

In [18]:
s.loc[1] = 100

In [19]:
s

2     10
3     30
4     20
5     40
1    100
dtype: int64

In [20]:
s.sort_index() # inplace = True сохраняет отсортированную индексацию
s

2     10
3     30
4     20
5     40
1    100
dtype: int64

Concat

In [21]:
a = pd.Series(data = [10,20,30], index = [1,2,3])
b = pd.Series(data = [100,200,300], index = [1,2,3])

In [22]:
a[2]

20

In [23]:
c = pd.concat([a,b]) # loc iloc
c

1     10
2     20
3     30
1    100
2    200
3    300
dtype: int64

In [24]:
c[1] = 1000# заменится 1 индекс на 1000 во всех местах
c

1    1000
2      20
3      30
1    1000
2     200
3     300
dtype: int64

In [25]:
c.index.is_unique

False

In [26]:
c.loc[1]

1    1000
1    1000
dtype: int64

In [27]:
c[1]=11
c

1     11
2     20
3     30
1     11
2    200
3    300
dtype: int64

In [28]:
c

1     11
2     20
3     30
1     11
2    200
3    300
dtype: int64

In [29]:
c.reset_index()[0]

0     11
1     20
2     30
3     11
4    200
5    300
Name: 0, dtype: int64

In [30]:
c.reset_index() # появляется столбец сквозных индексов с 0

   index    0
0      1   11
1      2   20
2      3   30
3      1   11
4      2  200
5      3  300

Agregation

In [31]:
values = [1,4,6,7, np.nan, 7,1, np.nan,4]
a = np.array(values)
b = pd.Series(values)

In [32]:
a

array([ 1.,  4.,  6.,  7., nan,  7.,  1., nan,  4.])

In [33]:
b

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [34]:
for c in a, b:
    print (type(c))
    print (c.mean(), c.max(), c.std())

<class 'numpy.ndarray'>
nan nan nan
<class 'pandas.core.series.Series'>
4.285714285714286 7.0 2.563479777846623

In [35]:
c # равная b

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [36]:
c.unique()

array([ 1.,  4.,  6.,  7., nan])

Частотный анализ

In [37]:
c.value_counts() #dropna = False без NaN

1.0    2
4.0    2
7.0    2
6.0    1
dtype: int64

In [38]:
c.value_counts(dropna = False) #dropna = False появился NaN

1.0    2
4.0    2
7.0    2
NaN    2
6.0    1
dtype: int64

In [39]:
c.quantile(3/4)#числа до 6,5 составляют 75% всех значений

6.5

In [40]:
c.min(), c.max(), c.mean(), c.median(), c.count(), c.std()

(1.0, 7.0, 4.285714285714286, 4.0, 7, 2.563479777846623)

In [41]:
c.describe()

count    7.000000
mean     4.285714
std      2.563480
min      1.000000
25%      2.500000
50%      4.000000
75%      6.500000
max      7.000000
dtype: float64

In [42]:
c.describe()['count'] # обращение к самой функции count

7.0

Skipped values

In [46]:
c.isna().sum() # any # sum показывает 2 значения Na

2

In [49]:
c.isna().any()# выдаст True если есть хоть одно значение Na, или False если нет Na

True

In [50]:
c.dropna() # inplace #удаляет пустые значения, при этом серия не меняется

0    1.0
1    4.0
2    6.0
3    7.0
5    7.0
6    1.0
8    4.0
dtype: float64

In [51]:
c

0    1.0
1    4.0
2    6.0
3    7.0
4    NaN
5    7.0
6    1.0
7    NaN
8    4.0
dtype: float64

In [52]:
c.dropna(inplace = True) # inplace меняет серию, теперь с(без Na)

In [53]:
c

0    1.0
1    4.0
2    6.0
3    7.0
5    7.0
6    1.0
8    4.0
dtype: float64

In [54]:
c.fillna(100) # inplace где были пустые значения будет 100 и без inplace не запишется

0    1.0
1    4.0
2    6.0
3    7.0
5    7.0
6    1.0
8    4.0
dtype: float64

Operations

In [57]:
A = pd.Series(data = [10,20,30,40], index = ['a', 'b', 'c', 'd'])
B = pd.Series(data = [1,2,3,4], index = ['a', 'b', 'c', 'd'])

In [58]:
A+B # > access mask умножение и сумма попарно

a    11
b    22
c    33
d    44
dtype: int64

In [59]:
A * B

a     10
b     40
c     90
d    160
dtype: int64

In [62]:
A[A > 25]  #A > 5

c    30
d    40
dtype: int64

In [63]:
import math

In [65]:
B.apply(math.sqrt)# получаем проиндексированные данные, где из каждого значения извлечен кв корень

a    1.000000
b    1.414214
c    1.732051
d    2.000000
dtype: float64

Update

In [73]:
a = pd.Series(data = [300,350,400,800,690], index = ['Bob','Bruce','Jim','Ian','Rob'])
b = pd.Series(data = [10000,0], index = ['Jim','Bob'])
a

Bob      300
Bruce    350
Jim      400
Ian      800
Rob      690
dtype: int64

In [74]:
b

Jim    10000
Bob        0
dtype: int64

In [71]:
a.update(b)# заменить значения для Jim i Bob

In [72]:
a

Bob          0
Bruce      350
Jim      10000
Ian        800
Rob        690
dtype: int64

In [76]:
a['Bruce':'Ian']

Bruce    350
Jim      400
Ian      800
dtype: int64

In [77]:
a.loc['Bruce':'Ian']#лучше работать с loc в data frame

Bruce    350
Jim      400
Ian      800
dtype: int64

### DATAFRAME

In [78]:
d = {"one": [1.0, 2.0, 3.0], "two": [4.0, 3.0, 2.0]}
df = pd.DataFrame(d, index = ['First','Second','Third'])

In [79]:
df.index

Index(['First', 'Second', 'Third'], dtype='object')

In [80]:
df

        one  two
First   1.0  4.0
Second  2.0  3.0
Third   3.0  2.0

In [84]:
df.one # или df['one'] доступ к серии

First     1.0
Second    2.0
Third     3.0
Name: one, dtype: float64

In [86]:
df.columns

Index(['one', 'two'], dtype='object')

новый столбик

In [97]:
df['three'] = df.one*20 + df.two**2 # запишется в новый столбец данное вычисленное выражение

In [98]:
df.three

First     36.0
Second    49.0
Third     64.0
dtype: float64

In [99]:
df

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [101]:
df[1:3] # работает как обычный срез

        one  two  three
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [102]:
df['First':'Second']

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0

In [104]:
df.iloc[1:3] # работает как обычный срез

        one  two  three
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [105]:
df.loc['First':'Second']# работает по индексам

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0

In [109]:
df.loc['Second'] # серия значений одной строки работает по индексам

one       2.0
two       3.0
three    49.0
Name: Second, dtype: float64

In [110]:
df.loc['Second', 'two']# указывается и строка  и графа

3.0

In [111]:
df.loc['First':'Second', 'one': 'two']# можно передать списком назв столбцов и

        one  two
First   1.0  4.0
Second  2.0  3.0

In [112]:
df.loc['First':'Second', ['three', 'one']]

        three  one
First    36.0  1.0
Second   49.0  2.0

In [115]:
df

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

Frame agregation

In [116]:
df.sum() # по умолчанию посчитает сумму по столбцам (то есть сложит значения в строках)

one        6.0
two        9.0
three    149.0
dtype: float64

In [117]:
df.sum(axis=1)  # по умолчанию посчитает сумму по cтрокам

First     41.0
Second    54.0
Third     69.0
dtype: float64

In [118]:
df.max()

one       3.0
two       4.0
three    64.0
dtype: float64

In [121]:
df.idxmax()# вернет индекс максимального элемента

one      Third
two      First
three    Third
dtype: object

In [3]:
df.agg(['min','idxmin', 'max', 'idxmax', 'sum', 'median'])# аггрегация, посчитает с пом функций

NameError: name 'df' is not defined

In [130]:
df

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [131]:
#drop

In [132]:
df.drop(columns = ['one', 'three'])# удаляет указанные столбцы

        two
First   4.0
Second  3.0
Third   2.0

In [135]:
df.drop(index = ['Second', 'Third'])# удаляет указанные строчки

       one  two  three
First  1.0  4.0   36.0

In [136]:
df.loc['Second','two'] = np.nan # ввести новое значение nan

In [138]:
df

        one  two  three
First   1.0  4.0   36.0
Second  2.0  NaN   49.0
Third   3.0  2.0   64.0

In [140]:
df.dropna()# удаляет по умолчанию строчку с nan

       one  two  three
First  1.0  4.0   36.0
Third  3.0  2.0   64.0

In [142]:
df.dropna(axis = 1) # 'columns' # удаляет cтолбец с nan

        one  three
First   1.0   36.0
Second  2.0   49.0
Third   3.0   64.0

In [143]:
df.interpolate() # интерполяция значение nan меняется на среднее ближайших по столбику

        one  two  three
First   1.0  4.0   36.0
Second  2.0  3.0   49.0
Third   3.0  2.0   64.0

In [144]:
df = pd.DataFrame({'name':['Петя','Маша','Марина','Петя','Маша','Марина','Марина','Маша','Марина','Тузик'],
                  'val1':[1,2,3,4,5,0,5,4,3,2],
                  'val2':[10,20,30,40,50,1,.5,.4,.3,.2]})

In [147]:
df

     name  val1  val2
0    Петя     1  10.0
1    Маша     2  20.0
2  Марина     3  30.0
3    Петя     4  40.0
4    Маша     5  50.0
5  Марина     0   1.0
6  Марина     5   0.5
7    Маша     4   0.4
8  Марина     3   0.3
9   Тузик     2   0.2

In [148]:
df.sum() # суммирует по каждой графе  значения, строки имена склеиваются

name    ПетяМашаМаринаПетяМашаМаринаМаринаМашаМаринаТузик
val1                                                   29
val2                                                152.4
dtype: object

In [149]:
df.agg(['min','max']) # тоже бессмысленно по именам

       name  val1  val2
min  Марина     0   0.2
max   Тузик     5  50.0

GroupBy

In [150]:
df.groupby(['name'])

In [151]:
df.groupby(['name']).sum()

        val1  val2
name
Марина    11  31.8
Маша      11  70.4
Петя       5  50.0
Тузик      2   0.2

In [152]:
df.groupby(['name']).val1.agg(['min','max'])

        min  max
name
Марина    0    5
Маша      2    5
Петя      1    4
Тузик     2    2